Revit 2027 API
GraphicsStyleType Enumeration
Describes the type of graphics style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum GraphicsStyleType
Public Enumeration GraphicsStyleType
public enum class GraphicsStyleType
type GraphicsStyleType
Members
Member name | Value | Description
Cut | 2 | Cut.
Projection | 1 | Projection.
See Also
Reference
Autodesk.Revit.DB Namespace